In [33]:
import pandas as pd 
import numpy as np
from pandas import Series,DataFrame
from numpy import nan as NA

In [34]:
df = DataFrame([[1,2,NA],[NA,NA,54],[21,3,34],[NA,NA,NA]],
               index=list('abcd'),
               columns=('col1','col2','col3'),)
df

   col1  col2  col3
a   1.0   2.0   NaN
b   NaN   NaN  54.0
c  21.0   3.0  34.0
d   NaN   NaN   NaN

In [35]:
df.dropna()# will drop all the NAs

   col1  col2  col3
c  21.0   3.0  34.0

In [29]:
# to drop if all the entrie in an row have NA 

df.dropna(thresh=2) # drop the rows which that more 2 data points as NA

   col1  col2  col3
a   1.0   2.0   NaN
c  21.0   3.0  34.0

In [30]:
# to do the same on columns 
df.dropna(thresh=2,axis=1)

   col1  col2  col3
a   1.0   2.0   NaN
b   NaN   NaN  54.0
c  21.0   3.0  34.0
d   NaN   NaN   NaN

In [31]:
df

   col1  col2  col3
a   1.0   2.0   NaN
b   NaN   NaN  54.0
c  21.0   3.0  34.0
d   NaN   NaN   NaN

In [32]:
df.dropna(how='all') # only drop if all the entries in the row have NAs

   col1  col2  col3
a   1.0   2.0   NaN
b   NaN   NaN  54.0
c  21.0   3.0  34.0

In [46]:
df.dropna(axis=1,thresh=3)

Empty DataFrame
Columns: []
Index: [a, b, c, d]

In [49]:
df.fillna('a') # fill all the values with given argument

  col1 col2 col3
a    1    2    a
b    a    a   54
c   21    3   34
d    a    a    a

In [50]:
# we also use a forward fild (ffill) and set limit to it

# Hierarchical Indexing

In [102]:
mdf = DataFrame(np.arange(16).reshape(4,4),
               index=[['one','one','two','two'],['a','b','a','b']],
                columns = [['hcol_1','hcol_1','hcol_2','hcol_2'],
                         ['1','2','3','4']])
mdf

      hcol_1     hcol_2
           1   2      3   4
one a      0   1      2   3
    b      4   5      6   7
two a      8   9     10  11
    b     12  13     14  15

In [106]:
mdf.index.names = ['alpha','num']
mdf.columns.names = ['Higher','lower']

In [107]:
mdf

Higher    hcol_1     hcol_2
lower          1   2      3   4
alpha num
one   a        0   1      2   3
      b        4   5      6   7
two   a        8   9     10  11
      b       12  13     14  15

In [109]:
mdf.sum(level='alpha')

Higher hcol_1     hcol_2
lower       1   2      3   4
alpha
one         4   6      8  10
two        20  22     24  26

In [111]:
mdf.sum(axis=1,level='lower')

lower       1   2   3   4
alpha num
one   a     0   1   2   3
      b     4   5   6   7
two   a     8   9  10  11
      b    12  13  14  15